<a href="https://colab.research.google.com/github/HimanshuSahoo/Himanshu_Python/blob/main/Random_Forest_Assignment_2_Fraud_Check.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Fraud_check.csv")
df

    Undergrad Marital.Status  ...  Work.Experience  Urban
0          NO         Single  ...               10    YES
1         YES       Divorced  ...               18    YES
2          NO        Married  ...               30    YES
3         YES         Single  ...               15    YES
4          NO        Married  ...               28     NO
..        ...            ...  ...              ...    ...
595       YES       Divorced  ...                7    YES
596       YES       Divorced  ...                2    YES
597        NO       Divorced  ...                0    YES
598       YES        Married  ...               17     NO
599        NO       Divorced  ...               16     NO

[600 rows x 6 columns]

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
dtypes: int64(3), object(3)
memory usage: 28.2+ KB

In [4]:
df.shape

(600, 6)

In [5]:
df.describe()

       Taxable.Income  City.Population  Work.Experience
count      600.000000       600.000000       600.000000
mean     55208.375000    108747.368333        15.558333
std      26204.827597     49850.075134         8.842147
min      10003.000000     25779.000000         0.000000
25%      32871.500000     66966.750000         8.000000
50%      55074.500000    106493.500000        15.000000
75%      78611.750000    150114.250000        24.000000
max      99619.000000    199778.000000        30.000000

In [6]:
df.isnull().sum()

Undergrad          0
Marital.Status     0
Taxable.Income     0
City.Population    0
Work.Experience    0
Urban              0
dtype: int64

In [7]:
df.loc[df["Taxable.Income"]<=30000.0,"taxable_income"]="Good"
df.loc[df["Taxable.Income"]>30000.1,"taxable_income"]="Risky"

In [8]:
df.head()

  Undergrad Marital.Status  ...  Urban  taxable_income
0        NO         Single  ...    YES           Risky
1       YES       Divorced  ...    YES           Risky
2        NO        Married  ...    YES           Risky
3       YES         Single  ...    YES           Risky
4        NO        Married  ...     NO           Risky

[5 rows x 7 columns]

In [9]:
df['taxable_income'].unique()

array(['Risky', 'Good'], dtype=object)

In [10]:
from sklearn import preprocessing
label_encoder=preprocessing.LabelEncoder()
df["Undergrad"]=label_encoder.fit_transform(df["Undergrad"])
df["Marital.Status"]=label_encoder.fit_transform(df["Marital.Status"])
df["Urban"]=label_encoder.fit_transform(df["Urban"])
df["taxable_income"]=label_encoder.fit_transform(df["taxable_income"])

In [11]:
df.head()

   Undergrad  Marital.Status  ...  Urban  taxable_income
0          0               2  ...      1               1
1          1               0  ...      1               1
2          0               1  ...      1               1
3          1               2  ...      1               1
4          0               1  ...      0               1

[5 rows x 7 columns]

# Bagged Decision Trees for Classification

In [12]:
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
from sklearn.ensemble import BaggingClassifier
from sklearn.tree import DecisionTreeClassifier

array = df.values
X = array[:,0:6]
Y = array[:,6]

kfold = KFold(n_splits=10)
cart = DecisionTreeClassifier()
num_trees = 100
model = BaggingClassifier(base_estimator=cart, n_estimators=num_trees)
results = cross_val_score(model, X, Y, cv=kfold)
print(results.mean())

0.9983333333333334

# Random Forest Classification

In [13]:
from sklearn.ensemble import RandomForestClassifier

x = array[:,0:6]
y = array[:,6]
num_trees = 100
max_features = 3
kfold = KFold(n_splits=10)
model = RandomForestClassifier(n_estimators=num_trees, max_features=max_features)
results = cross_val_score(model, x, y, cv=kfold)
print(results.mean())

0.9983333333333334

# AdaBoost Classification

In [14]:
from sklearn.ensemble import AdaBoostClassifier

x1 = array[:,0:6]
y1 = array[:,6]

num_trees = 10
seed=7
kfold = KFold(n_splits=10)
model = AdaBoostClassifier(n_estimators=num_trees, random_state=seed)
results = cross_val_score(model, x1, y1, cv=kfold)
print(results.mean())

0.9983333333333334

# Stacking Ensemble for Classification

In [15]:
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.svm import SVC
from sklearn.ensemble import VotingClassifier

x2 = array[:,0:6]
y2 = array[:,6]
kfold = KFold(n_splits=10)

# sub models
estimators = []
model1 = LogisticRegression(max_iter=500)
estimators.append(('logistic', model1))
model2 = DecisionTreeClassifier()
estimators.append(('cart', model2))
model3 = SVC()
estimators.append(('svm', model3))

# ensemble model
ensemble = VotingClassifier(estimators)
results = cross_val_score(ensemble, x2, y2, cv=kfold)
print(results.mean())

0.985